app/views/listings/index.html.erb

		<ul>
		<% l.tags.each do |t| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "listingtags" ON "tags"."id" = "listingtags"."tag_id" WHERE "listingtags"."listing_id" = $1  [["listing_id", 10]]