app/views/listings/show.html.erb

  <div class="media-left media-top">
		<% unless @listing.user.avatars.empty? %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 5]]

		<h4>
    <% @listing.tags.each do |t| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "listingtags" ON "tags"."id" = "listingtags"."tag_id" WHERE "listingtags"."listing_id" = $1  [["listing_id", 10]]