app/views/users/show.html.erb

<h2>My Listings</h2>
<% @user.listings.each do |l| %>
<p><%= link_to l.title, listing_path(l.id) %></p>
			<% l.reservations.each do |r| %>
---
SELECT "listings".* FROM "listings" WHERE "listings"."user_id" = $1  [["user_id", 2]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = $1  [["user_id", 2]]