app/controllers/listings_controller.rb

	def index
		if params[:query].present?
			@listing = Listing.search(params[:query])

		else
			@listing = Listing.order(created_at: :desc)
			@listing = @listing.paginate(:page => params[:page], :per_page => 5)
---
SELECT "listings".* FROM "listings"
SELECT  "listings".* FROM "listings"  ORDER BY "listings"."created_at" DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "listings"

	def create
		@listing = current_user.listings.new(listing_params)
		if @listing.save
			@tag = params[:listing][:tags][:tag].split(",")
			@tag.each{ |x| x.gsub!(" ", "")}
			@tag.map {|x| x.capitalize}
			@tag = @tag.uniq
				@tag.each do |t|
					@listing.tags << Tag.find_or_create_by(tag: "#{t}")
---
INSERT INTO "listings" ("title", "description", "propertytype", "roomtype", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "test"], ["description", ""], ["propertytype", ""], ["roomtype", ""], ["user_id", 1], ["created_at", "2016-07-22 05:01:33.477577"], ["updated_at", "2016-07-22 05:01:33.477577"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."tag" = $1 LIMIT 1  [["tag", "comfy"]]
INSERT INTO "listingtags" ("listing_id", "tag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["listing_id", 13], ["tag_id", 1], ["created_at", "2016-07-21 05:04:59.057931"], ["updated_at", "2016-07-21 05:04:59.057931"]]
INSERT INTO "tags" ("tag", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["tag", "comfy"], ["created_at", "2016-07-21 05:04:59.041496"], ["updated_at", "2016-07-21 05:04:59.041496"]]
SELECT "tags".* FROM "tags" INNER JOIN "listingtags" ON "tags"."id" = "listingtags"."tag_id" WHERE "listingtags"."listing_id" = $1  [["listing_id", 13]]

	def edit
		@taglist = []
		@listing.tags.each {|x| @taglist << x.tag}
---
SELECT "tags".* FROM "tags" INNER JOIN "listingtags" ON "tags"."id" = "listingtags"."tag_id" WHERE "listingtags"."listing_id" = $1  [["listing_id", 1]]

	def update
		if @listing.update(listing_params)

			@tag = params[:listing][:tags][:tag].split(",")
			@tag.each{ |x| x.gsub!(" ", "")}
			@tag.map {|x| x.capitalize}
			@tag = @tag.uniq
			latest_tag = []
				@tag.each do |t|
					unless Tag.find_by_tag(t).nil?
							find_tag_id = Tag.find_by_tag(t).id
							unless Listingtag.where(listing_id: @listing.id, tag_id: find_tag_id).first.nil?
								latest_tag << find_tag_id
								next
							else
								new_tag = Tag.find_or_create_by(tag: "#{t}")
								@listing.tags << new_tag
								latest_tag << new_tag.id
							end
					else
						new_tag = Tag.create(tag: "#{t}")
						@listing.tags << new_tag
						latest_tag << new_tag.id
					end
				end
			old_tag = []
			Listingtag.where(listing_id: @listing.id).all.each { |t| old_tag << t.tag_id }
---
UPDATE "listings" SET "avatars" = $1, "updated_at" = $2 WHERE "listings"."id" = $3  [["avatars", "[\"d7693434-f129-49b7-a75b-66a80d5cc1dd.jpg\"]"], ["updated_at", "2016-07-21 10:53:02.885555"], ["id", 1]]
SELECT  "tags".* FROM "tags" WHERE "tags"."tag" = $1 LIMIT 1  [["tag", "comfy"]]
SELECT  "listingtags".* FROM "listingtags" WHERE "listingtags"."listing_id" = $1 AND "listingtags"."tag_id" = $2  ORDER BY "listingtags"."id" ASC LIMIT 1  [["listing_id", 8], ["tag_id", 3]]
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT 1  [["id", 18]]
INSERT INTO "tags" ("tag", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["tag", "test"], ["created_at", "2016-07-22 03:20:11.611451"], ["updated_at", "2016-07-22 03:20:11.611451"]]
INSERT INTO "listingtags" ("listing_id", "tag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["listing_id", 1], ["tag_id", 1], ["created_at", "2016-07-21 10:53:02.921909"], ["updated_at", "2016-07-21 10:53:02.921909"]]
SELECT "tags".* FROM "tags" INNER JOIN "listingtags" ON "tags"."id" = "listingtags"."tag_id" WHERE "listingtags"."listing_id" = $1  [["listing_id", 12]]

			else
				delete_tag = old_tag - latest_tag
				delete_tag.each do |d|
					Listingtag.where(listing_id: @listing.id, tag_id: d).first.destroy
---
DELETE FROM "listings" WHERE "listings"."id" = $1  [["id", 12]]
DELETE FROM "listingtags" WHERE "listingtags"."id" = $1  [["id", 37]]
DELETE FROM "tags" WHERE "tags"."id" = $1  [["id", 18]]

	def destroy
		@listing.destroy
---
DELETE FROM "listings" WHERE "listings"."id" = $1  [["id", 3]]

	def set_listings
		@listing = Listing.find(params[:id])
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT 1  [["id", 3]]