app/controllers/reservations_controller.rb

SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = $1 AND "reservations"."payment" = $2  [["user_id", 2], ["payment", "f"]]
---
	def index
		@reservations = Reservation.where(user_id: current_user.id, payment: false)

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT 1  [["id", 21]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."listing_id" = $1  [["listing_id", 21]]
SELECT COUNT(*) FROM "reservations" WHERE "reservations"."listing_id" = $1  [["listing_id", 21]]
INSERT INTO "reservations" ("start_date", "end_date", "listing_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["start_date", "2016-07-25"], ["end_date", "2016-07-29"], ["listing_id", 21], ["user_id", 2], ["created_at", "2016-07-25 06:49:35.395615"], ["updated_at", "2016-07-25 06:49:35.395615"]]
---
	def create
		@listing = Listing.find(params[:listing_id])
		@reservation = @listing.reservations.new(reservation_params)
		if @reservation.wrongDate?
			flash[:danger] = "Start date is greater than end date"
		else
			reserve_check = Reservation.where(listing_id: @listing.id)
			reserve_check_count = reserve_check.count
			unless reserve_check.empty?

				reserve_check.each_with_index do |r, ind|
					if @reservation.overlap?(r)
						flash[:danger] = "date overlaps with other user"
						break
					elsif ind+1 == reserve_check_count
						if @reservation.overlap?(r)
							flash[:danger] = "date overlaps with other user"
							redirect_to listing_path(@listing)
						else
							@reservation.user_id = current_user.id
							@reservation.save

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "reservations" WHERE "reservations"."id" = $1  [["id", 3]]
---
	def destroy
		@reservation = Reservation.find(params[:id])
		@reservation.destroy