app/controllers/sessions_controller.rb

      def create_from_omniauth
        auth_hash = request.env["omniauth.auth"]

        authentication = Authentication.find_by_provider_and_uid(auth_hash["provider"], auth_hash["uid"]) || Authentication.create_with_omniauth(auth_hash)
        if authentication.user
          user = authentication.user
          authentication.update_token(auth_hash)
          @next = user_path(user)
          @notice = "Signed in!"
        else
          user = User.create_with_auth_and_hash(authentication,auth_hash)
---
INSERT INTO "authentications" ("provider", "uid", "token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT  "authentications".* FROM "authentications" WHERE "authentications"."provider" = $1 AND "authentications"."uid" = $2 LIMIT 1  [["provider", "facebook"], ["uid", "10210207290041628"]]
UPDATE "authentications" SET "user_id" = $1, "updated_at" = $2 WHERE "authentications"."id" = $3  [["user_id", "3"], ["updated_at", "2016-07-19 06:10:18.852918"], ["id", 1]]
INSERT INTO "users" ("email", "created_at", "updated_at", "remember_token") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "waterheater_kao@hotmail.com"], ["created_at", "2016-07-19 06:01:09.561627"], ["updated_at", "2016-07-19 06:01:09.561627"], ["remember_token", "adbe0b35b4ea6d150c9eea8ff34bbd2c1c7c7b6f"]]