app/controllers/transactions_controller.rb

SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = $1 AND "reservations"."payment" = $2  [["user_id", 2], ["payment", "f"]]
UPDATE "reservations" SET "payment" = $1, "transaction_id" = $2, "updated_at" = $3 WHERE "reservations"."id" = $4  [["payment", "t"], ["transaction_id", "222nr0jb"], ["updated_at", "2016-07-29 03:37:12.556569"], ["id", 51]]
---
  def create
    @reservations = Reservation.where(user_id: current_user.id, payment: false)
  	@result = Braintree::Transaction.sale(
              amount: cart_total_price(@reservations),
              payment_method_nonce: params[:payment_method_nonce])
    if @result.success?
      @reservations.each { |r| r.update_attributes(payment: true, transaction_id: @result.transaction.id) }