app/controllers/users_controller.rb

	def update
		@user = User.find(params[:id])
		if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 8]]
UPDATE "users" SET "fullname" = $1, "username" = $2, "avatars" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["fullname", "teting"], ["username", "Cat tester"], ["avatars", "[\"cat.jpg\"]"], ["updated_at", "2016-07-22 08:20:48.347343"], ["id", 2]]